Revit 2017 API
StructuralSectionISplitSlopedFlange Class
 Defines parameters for I-split Sloped Flange structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public class StructuralSectionISplitSlopedFlange : StructuralSectionHotRolled
Visual Basic
Public Class StructuralSectionISplitSlopedFlange _
	Inherits StructuralSectionHotRolled
Visual C++
public ref class StructuralSectionISplitSlopedFlange : public StructuralSectionHotRolled
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISplitSlopedFlange
See Also
StructuralSectionISplitSlopedFlange Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace